#define ESAM_DRV_C
#include "Pub_PUCK.h"

#if PREPAID_METER>0




/**********************************************************************************/
/**********************************************************************************/ 
void Set_Esam_IO_Dir(void)
{
    SET_ESAM_PWR_DIR;      //输出:1-----开启电源
    SET_ESAM_RST_DIR;      //输出:0-------有效
    SET_ESAM_CLK_DIR;      //输出:0-------使能时钟    
}
/**********************************************************************************
**********************************************************************************/ 
void Set_Esam_Pwr(INT8U Level)
{
  SET_ESAM_PWR_DIR;        //输出:1-----开启电源
  SET_ESAM_POWER(Level);
}
/**********************************************************************************
**********************************************************************************/ 
void Set_Esam_Rst(INT8U Level)
{
  SET_ESAM_RST_DIR;
  SET_ESAM_RST(Level);
}
/**********************************************************************************
**********************************************************************************/ 
void Set_Esam_Clk(INT8U Level)
{
#ifdef LOW_COST_HARD_EN   //Level：0表示开启soft时钟
  INIT_ESAM_CLK;
  if(Level)
    STOP_ESAM_CLK;
  else    
    START_ESAM_CLK;  
#else  
  SET_ESAM_CLK_DIR;
  SET_ESAM_CLK(Level);
#endif  
}
#endif